; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v7)
             (pred_5 ?v6 ?v13)
             (pred_8 ?v2 ?v13)
             (pred_9 ?v11 ?v2 )
	     (pred_6 ?v2)
             (pred_10 ?v9)
             (pred_3 ?v6)
             (pred_7 ?v13)
             (pred_11 ?v2)
             (pred_1 ?v6)
             (pred_2 ?v2)
             (pred_12 ))



(:action op_2
:parameters (?v3 ?v1 ?v4 ?v10)
:precondition (and (pred_10 ?v3) (pred_10 ?v1) (pred_3 ?v4) (pred_7 ?v10)
          (pred_4 ?v3 ?v1) (pred_5 ?v4 ?v10)
                   (pred_8 ?v1 ?v10) (pred_6 ?v3) 
                   (pred_11 ?v1) (pred_1 ?v4))
:effect (and  (pred_2 ?v1) (not (pred_11 ?v1))))


(:action op_3
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_10 ?v12)
               (pred_6 ?v3) (pred_4 ?v3 ?v12) (pred_2 ?v12))
:effect (and (pred_6 ?v12) (not (pred_6 ?v3))))

(:action op_4
:parameters (?v3 ?v4)
:precondition (and (pred_10 ?v3) (pred_3 ?v4) 
                  (pred_6 ?v3) (pred_9 ?v4 ?v3) (pred_12 ))
:effect (and (pred_1 ?v4)
   (not (pred_9 ?v4 ?v3)) (not (pred_12 ))))


(:action op_5
:parameters (?v3 ?v5 ?v8)
:precondition (and (pred_10 ?v3) (pred_3 ?v5) (pred_3 ?v8)
                  (pred_6 ?v3) (pred_1 ?v8) (pred_9 ?v5 ?v3))
:effect (and (pred_1 ?v5) (pred_9 ?v8 ?v3)
        (not (pred_1 ?v8)) (not (pred_9 ?v5 ?v3))))

(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_10 ?v3) (pred_3 ?v4) 
                  (pred_6 ?v3) (pred_1 ?v4))
:effect (and (pred_12 ) (pred_9 ?v4 ?v3) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_03 obj_01 obj_17 obj_06 obj_04 obj_19 obj_02 obj_12 obj_09 obj_14 obj_08 obj_18 obj_13 obj_10 obj_20
    obj_15 obj_22 obj_21
    obj_05 obj_07 obj_11
    )

    (:init
       (pred_12)

       (pred_10 obj_16)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_06)
       (pred_10 obj_04)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_22)
       (pred_7 obj_21)
       (pred_3 obj_05)
       (pred_3 obj_07)
       (pred_3 obj_11)

       (pred_4 obj_16 obj_06)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_03 obj_04)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_17)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_17 obj_01)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_03)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_14)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_14 obj_09)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_8  obj_20 obj_15)
       (pred_8  obj_08 obj_22)
       (pred_8  obj_18 obj_21)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_04)
       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_12)
       (pred_2 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_10)

       (pred_5  obj_05 obj_15)
       (pred_5  obj_07 obj_22)
       (pred_5  obj_11 obj_21)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_11 obj_17)
       (pred_6 obj_01)
    )

    (:goal (and
       (pred_9 obj_07 obj_13)
       (pred_9 obj_11 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_09)))
)
)

; plan
1. (op_3 obj_01 obj_17)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_17)
   goals met: 0 of 2
2. (op_4 obj_17 obj_11)
   deleted: (pred_9 obj_11 obj_17) (pred_12)
   added: (pred_1 obj_11)
   goals met: 0 of 2
3. (op_3 obj_17 obj_01)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_01)
   goals met: 0 of 2
4. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 0 of 2
5. (op_3 obj_03 obj_04)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_04)
   goals met: 0 of 2
6. (op_3 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 0 of 2
7. (op_3 obj_06 obj_12)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_18 obj_11 obj_21)
   deleted: (pred_11 obj_18)
   added: (pred_2 obj_18)
   goals met: 0 of 2
9. (op_3 obj_12 obj_18)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_18)
   goals met: 0 of 2
10. (op_3 obj_18 obj_13)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_13)
   goals met: 0 of 2
11. (op_1 obj_13 obj_11)
   deleted: (pred_1 obj_11)
   added: (pred_12) (pred_9 obj_11 obj_13)
   goals met: 0 of 2
12. (op_3 obj_13 obj_18)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_18)
   goals met: 0 of 2
13. (op_3 obj_18 obj_12)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_12)
   goals met: 0 of 2
14. (op_3 obj_12 obj_06)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_06)
   goals met: 0 of 2
15. (op_3 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 0 of 2
16. (op_3 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_03)
   goals met: 0 of 2
17. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 2
18. (op_3 obj_01 obj_17)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_17)
   goals met: 0 of 2
19. (op_4 obj_17 obj_07)
   deleted: (pred_9 obj_07 obj_17) (pred_12)
   added: (pred_1 obj_07)
   goals met: 0 of 2
20. (op_3 obj_17 obj_01)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_01)
   goals met: 0 of 2
21. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 0 of 2
22. (op_3 obj_03 obj_04)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_04)
   goals met: 0 of 2
23. (op_3 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 0 of 2
24. (op_3 obj_06 obj_12)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_12)
   goals met: 0 of 2
25. (op_3 obj_12 obj_18)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_18)
   goals met: 0 of 2
26. (op_3 obj_18 obj_13)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_13)
   goals met: 0 of 2
27. (op_5 obj_13 obj_11 obj_07)
   deleted: (pred_1 obj_07) (pred_9 obj_11 obj_13)
   added: (pred_1 obj_11) (pred_9 obj_07 obj_13)
   goals met: 1 of 2
28. (op_3 obj_13 obj_18)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_18)
   goals met: 1 of 2
29. (op_1 obj_18 obj_11)
   deleted: (pred_1 obj_11)
   added: (pred_12) (pred_9 obj_11 obj_18)
   goals met: 2 of 2
